app/Filament/Widgets/AssetStatsOverview.php

select count(*) as aggregate from `assets`
select count(*) as aggregate from `assets` where `condition_id` in (1, 4)
select count(*) as aggregate from `asset_taxes` where `payment_status` in ('unpaid', 'pending') and `due_date` >= '2026-01-03 06:09:15' and `asset_taxes`.`deleted_at` is null
---
    protected function getStats(): array
    {
        try {
            return cache()->remember('dashboard.asset.stats', 300, function() {
                // Optimized: Single query untuk multiple counts
                $counts = Asset::selectRaw('
                    COUNT(*) as total,
                    SUM(CASE WHEN condition_id IN (1, 4) THEN 1 ELSE 0 END) as good_new,
                    SUM(CASE WHEN condition_id IN (2, 3) THEN 1 ELSE 0 END) as damaged_repair
                ')->first();

                $taxesToPay = AssetTax::whereIn('payment_status', ['unpaid', 'pending'])
                    ->where('due_date', '>=', Carbon::now())
                    ->count();

                $totalAssets = $counts->total ?? 0;
                $goodNewAssets = $counts->good_new ?? 0;
                $damagedRepairAssets = $counts->damaged_repair ?? 0;

            return [
                Stat::make('Total Aset', number_format($totalAssets))
                    ->description('Total semua aset')
                    ->descriptionIcon('heroicon-o-cube')
                    ->color('primary')