app/Filament/Widgets/AssetByConditionChart.php

select `master_assets_condition`.`name`, count(assets.id) as total from `assets` inner join `master_assets_condition` on `assets`.`condition_id` = `master_assets_condition`.`id` group by `master_assets_condition`.`name`, `master_assets_condition`.`id`
---
    protected function getData(): array
    {
        try {
            $data = Asset::join('master_assets_condition', 'assets.condition_id', '=', 'master_assets_condition.id')
                ->select('master_assets_condition.name', DB::raw('count(assets.id) as total'))
                ->groupBy('master_assets_condition.name', 'master_assets_condition.id')
                ->pluck('total', 'name')
                ->toArray();