app/Filament/Widgets/AssetPurchasesChart.php

    protected function getDataByMonth(): array
    {
        $data = [];
        $labels = [];
        $daysInMonth = Carbon::now()->daysInMonth;

        $counts = cache()->remember('chart.asset-purchases.month.' . now()->format('Y-m'), 300, function () {
            return AssetPurchase::whereYear('created_at', now()->year)
                ->whereMonth('created_at', now()->month)
                ->selectRaw('DAY(created_at) as day, COUNT(*) as total')
                ->groupBy('day')
                ->pluck('total', 'day')
                ->toArray();
        });
---
select count(*) as aggregate from `asset_purchases` where date(`created_at`) = '2026-01-01'