app/Filament/Widgets/AssetByLocationChart.php

    protected function getData(): array
    {
        // Get assets with their current location from latest mutation
        $data = DB::table('assets')
            ->leftJoin('assets_mutation', function ($join) {
                $join->on('assets.id', '=', 'assets_mutation.assets_id')
                    ->whereRaw('assets_mutation.id = (SELECT id FROM assets_mutation WHERE assets_id = assets.id ORDER BY mutation_date DESC LIMIT 1)');
            })
            ->leftJoin('master_assets_locations', 'assets_mutation.location_id', '=', 'master_assets_locations.id')
            ->select('master_assets_locations.name', DB::raw('count(assets.id) as total'))
            ->groupBy('master_assets_locations.name')
            ->pluck('total', 'name')
            ->toArray();

        // Remove null entries
        $data = array_filter($data, function ($key) {
            return $key !== null && $key !== '';
        }, ARRAY_FILTER_USE_KEY);

        // If no data from mutations, count assets without location
        if (empty($data)) {
            $totalAssets = Asset::count();
---
select `master_assets_locations`.`name`, count(assets.id) as total from `assets` left join `assets_mutation` on `assets`.`id` = `assets_mutation`.`assets_id` and assets_mutation.id = (SELECT id FROM assets_mutation WHERE assets_id = assets.id ORDER BY mutation_date DESC LIMIT 1) left join `master_assets_locations` on `assets_mutation`.`location_id` = `master_assets_locations`.`id` group by `master_assets_locations`.`name`
select count(*) as aggregate from `assets`