app/Filament/Widgets/AssetByMutationTypeChart.php

select `master_assets_transaction_status`.`name`, count(assets_mutation.id) as total from `assets_mutation` inner join `master_assets_transaction_status` on `assets_mutation`.`transaction_status_id` = `master_assets_transaction_status`.`id` group by `master_assets_transaction_status`.`name`, `master_assets_transaction_status`.`id`
select count(*) as aggregate from `assets_mutation`
---
    protected function getData(): array
    {
        return cache()->remember('chart.asset.by.mutation-type', 600, function () {
            try {
                // Get mutation count by transaction status (jenis mutasi)
                $data = AssetMutation::join('master_assets_transaction_status', 'assets_mutation.transaction_status_id', '=', 'master_assets_transaction_status.id')
                    ->select('master_assets_transaction_status.name', DB::raw('count(assets_mutation.id) as total'))
                    ->groupBy('master_assets_transaction_status.name', 'master_assets_transaction_status.id')
                    ->pluck('total', 'name')
                    ->toArray();

                // If no mutation data, count total mutations or show placeholder
                if (empty($data)) {
                    $totalMutations = AssetMutation::count();
                    $data['Belum Ada Mutasi'] = $totalMutations > 0 ? $totalMutations : 1;
                }
            } catch (\Exception $e) {
                // Fallback jika ada error
                $data['Belum Ada Mutasi'] = 1;
            }

            $colors = $this->generateColors(count($data));
